###
# brew bundle install
##

## Taps

tap "denisidoro/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

## Installs

# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Cross platform file encryption utility using blowfish
brew "bcrypt"
# GNU binary tools for native development
brew "binutils"
# GNU File, Shell, and Text utilities
brew "coreutils"
# File comparison utilities
brew "diffutils"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Load/unload environment variables based on $PWD
brew "direnv"
# Classic UNIX line editor
brew "ed"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Git dotfiles synchronizer written in bash
brew "homeshick"
# Instant coding answers via the command-line
brew "howdoi"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Utility to list open files
brew "lsof"
# Text-based web browser
brew "lynx"
# Macro processing language
brew "m4"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Powerful paging program
brew "most"
# Platform built on V8 to build network applications
brew "node"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Fast CSV toolkit written in Rust
brew "xsv"
# Process YAML documents from the CLI
brew "yq"
# Interactive cheatsheet tool for the command-line.
brew "denisidoro/tools/navi"

## Casks

cask "alfred"
cask "atom"
cask "diffmerge"
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "java"
cask "lastpass"
cask "slack"
